# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [2]:
# your code here
%load_ext sql
%config SqlMagic.autocommit = False

In [2]:
%sql sqlite:///../data/juliarochflores.db

In [15]:
%%sql join_1 <<

SELECT
rank_info.name,
lastName,
age,
country,
rank_info."position" 
FROM personal_info
JOIN rank_info
ON rank_info.id = personal_info.id;

 * sqlite:///../data/juliarochflores.db
Done.
Returning data to local variable join_1

In [19]:
%%sql join_2 <<

SELECT 
personal_info.id,
personal_info.lastName,
"Source",
worth,
realTimePosition
FROM business_info
JOIN personal_info 
ON personal_info.id = business_info.id
ORDER BY personal_info.id;

 * sqlite:///../data/juliarochflores.db
Done.
Returning data to local variable join_2

In [20]:
display(join_1.DataFrame())

display(join_2.DataFrame())

,name,lastName,age,country,position
0,jefF BEZOs,BEZOS,54 years old,United States,1.0
1,bILL GATES,GATES,62 years old,None,2.0
2,WARREN BUFFEtt,bufFETT,87 years old,None,3.0
3,bernARD ARNAULT,arNAULt,69 years old,France,4.0
4,maRK ZUCKERBERG,zUCKERBERg,1985,United States,5.0
...,...,...,...,...,...
2203,zhao XIAOQiang,ZHAO,51 years old,China,2204.0
2204,zHOU LIANgzhang,zhOU,55 years old,None,2205.0
2205,zhu XINGMIng,zHU,51 years old,People's Republic of China,2206.0
2206,ZHUO JUN,ZHUO,52 years old,None,2207.0
2207,olguN ZOrlu,zoRLu,54 years old,Turkey,2208.0

,id,lastName,Source,worth,realTimePosition
0,1001,plATt,Finance and Investments ==> hedge funds,6.9 BUSD,253
1,1005,KOO,Technology ==> electronics/household products,1.0 BUSD,1994
2,1008,toELLer,Fashion & Retail ==> pet food,1.7 BUSD,1538
3,1015,snYDER,Sports ==> Washington Redskins,2.3 BUSD,1080
4,1017,kohLER,Manufacturing ==> plumbing fixtures,9.3 BUSD,169
...,...,...,...,...,...
2203,9981,feRTITTa,"Sports ==> casinos, mixed martial arts",2.2 BUSD,1095
2204,9983,shaMALOv,Energy ==> petrochemicals,1.4 BUSD,1640
2205,9988,aLEXANDEr,Sports ==> sports team,2.1 BUSD,1192
2206,9996,al ghURAIr,Diversified ==> diversified,5.9 BUSD,315
2207,9998,sANDs,Food and Beverage ==> Food & Beverage,3.0 BUSD,736

# Challenge 2 - Working with JSON files

Import the pandas library.

In [3]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [27]:
# your code here
nasa = pd.read_json('../data/nasa.json', orient='columns')

Now that we have loaded the data, let's examine it using the `head()` function.

In [28]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [33]:
# your code here
nasa['fall'].value_countsnts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [34]:
# your code here
nasa.to_json('../data/nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [3]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [17]:
# your code here
shuttle = pd.read_csv(tst_url, sep=' ', names=cols)

Let's verify that this worked by looking at the `head()` function.

In [18]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [19]:
# your code here
shuttle.to_csv('../data/shuttle.csv', index=False, sep=',')

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [4]:
# your code here

#xlrd is installed. Checked in terminal with -> conda list | grep xlrd

astronaut = pd.read_excel('../data/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [5]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [6]:
# your code here
astronaut['Undergraduate Major'].value_counts()

#The most popular undergraduate major is Physics with 35 astronauts

Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Physics & Mechanical Engineering          1
Electronics Engineering                   1
Marine Engineering & Nautical Science     1
Music                                     1
Military Engineering                      1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [7]:
# your code here
astronaut.to_csv('../data/astronaut.csv', index=False, sep='\t')

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [12]:
# your code here
"""

Attribute Information:

Season in which the analysis was performed. 1) winter, 2) spring, 3) Summer, 4) fall. (-1, -0.33, 0.33, 1)

Age at the time of analysis. 18-36 (0, 1)

Childish diseases (ie , chicken pox, measles, mumps, polio) 1) yes, 2) no. (0, 1)

Accident or serious trauma 1) yes, 2) no. (0, 1)

Surgical intervention 1) yes, 2) no. (0, 1)

High fevers in the last year 1) less than three months ago, 2) more than three months ago, 3) no. (-1, 0, 1)

Frequency of alcohol consumption 1) several times a day, 2) every day, 3) several times a week, 4) once a week, 5) hardly ever or never (0, 1)

Smoking habit 1) never, 2) occasional 3) daily. (-1, 0, 1)

Number of hours spent sitting per day ene-16 (0, 1)

Output: Diagnosis normal (N), altered (O) 
"""

col_names = ['Season', 'Age', 'Childish diseases', 'Accident', 'Surgical intervention', 'High fevers last year', ' Alcohol consumption', 'Smoking habit', 'NÂº hours sitted', 'Diagnosis']
fertility = pd.read_csv('../data/fertility_Diagnosis.txt', sep=',', names = col_names)
fertility.head(10)

,Season,Age,Childish diseases,Accident,Surgical intervention,High fevers last year,Alcohol consumption,Smoking habit,NÂº hours sitted,Diagnosis
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O
5,-0.33,0.67,1,0,1,0,0.8,0,0.50,N
6,-0.33,0.67,0,0,0,-1,0.8,-1,0.44,N
7,-0.33,1.00,1,1,1,0,0.6,-1,0.38,N
8,1.00,0.64,0,0,1,0,0.8,-1,0.25,N
9,1.00,0.61,1,0,0,0,1.0,-1,0.25,N